<template>
    <p class="effect-p" v-if="!Router().overdose">Еще рано...</p>
    <p class="effect-p" v-else v-html="string"></p>
</template>

<script setup>
    import Router from "@/stores/Router.js";
    import { getRandomItem } from "@/script/helpers/random.js";
    
    const string = `
        Смерть&nbsp;&mdash; это неизбежный и&nbsp;необратимый процесс прекращения жизни. Она представляет собой окончательное прекращение всех биологических функций организма, включая дыхание, сердечную деятельность и&nbsp;мозговую активность. Смерть сопровождается потерей сознания и&nbsp;прекращением всех чувств и&nbsp;восприятий. Она является естественным завершением жизненного цикла каждого живого существа, включая людей и&nbsp;животных. После смерти тело начинает разлагаться, и&nbsp;процесс возвращения в&nbsp;землю называется разложением. В&nbsp;разных культурах и&nbsp;религиях отношение к&nbsp;смерти различно, и&nbsp;существуют разные верования о&nbsp;том, что происходит после смерти.
    `
</script>

<style lang="scss" scoped>
</style>