<template>
    <p class="effect-p" :overdose="Router().overdose || null" v-html="string"></p>
</template>

<script setup>
    import Router from "@/stores/Router.js";
    import { getRandomItem } from "@/script/helpers/random.js";
    
    const string = `
        Передозировка&nbsp;&mdash; это медицинский термин, который означает употребление или применение избыточного количества лекарственного средства, вещества или яда, превышающего рекомендуемую дозу или безопасный предел для организма. Передозировка может иметь серьезные последствия и&nbsp;представлять угрозу для здоровья и&nbsp;жизни человека. Симптомы передозировки могут включать тошноту, рвоту, головокружение, потерю сознания, проблемы с&nbsp;дыханием, аритмию и&nbsp;даже судороги. Следует немедленно обратиться за&nbsp;медицинской помощью при подозрении на&nbsp;передозировку, поскольку она требует профессионального вмешательства. В&nbsp;некоторых случаях может потребоваться промывание желудка, введение противоядия или других методов лечения, направленных на&nbsp;нейтрализацию вредных эффектов передозировки.
    `
</script>

<style lang="scss" scoped>
    p{
        transition: .3s;
        
        &:not([overdose]){
            @include hidden(0);
        }
    }
</style>